In [18]:
import pandas as pd
import numpy as np 
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, r2_score

In [7]:
df = pd.read_csv("../DataSets/Salaries.csv")
df.head()

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [9]:
df.isnull().sum()

Unnamed: 0       0
rank             0
discipline       0
yrs.since.phd    0
yrs.service      0
sex              0
salary           0
dtype: int64

In [ ]:
df = df.drop(columns=["Unnamed: 0"])

In [13]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
0      Prof          B             19           18  Male  139750
1      Prof          B             20           16  Male  173200
2  AsstProf          B              4            3  Male   79750
3      Prof          B             45           39  Male  115000
4      Prof          B             40           41  Male  141500

In [14]:
df_encoded = pd.get_dummies(df, drop_first=True)
df_encoded.head()

,yrs.since.phd,yrs.service,salary,rank_AsstProf,rank_Prof,discipline_B,sex_Male
0,19,18,139750,False,True,True,True
1,20,16,173200,False,True,True,True
2,4,3,79750,True,False,True,True
3,45,39,115000,False,True,True,True
4,40,41,141500,False,True,True,True

In [16]:
X = df_encoded.drop(columns=["salary"])
Y = df_encoded["salary"]

In [21]:
X_train, X_test, y_train, y_test = train_test_split(X,Y, test_size = 0.3, random_state = 45)

model = LinearRegression()
model.fit(X_train, y_train)

y_pred = model.predict(X_test)

mse = mean_squared_error(y_test, y_pred)
r2 = r2_score(y_test, y_pred)

coefficients = pd.DataFrame(model.coef_, X.columns, columns = ["Coefficients"])

print(mse)
print(r2)
print(coefficients)

663339419.2580142
0.3553750807920475
               Coefficients
yrs.since.phd    471.115968
yrs.service     -170.646200
rank_AsstProf  -9440.858566
rank_Prof      31026.039798
discipline_B   16542.875429
sex_Male        4881.747384